// Вам необхідно написати функцію, яка приймає на вхід масив чисел і повертає новий масив, що містить тільки ті числа, які є простими числами.
const arraySimpleNum = [
  2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71,
  73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151,
  157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233,
  239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293,
];

function checkSimple(arrCheck) {
  let result = [];
  for (let i = 0; i < arrCheck.length; i++) {
    if (arraySimpleNum.includes(arrCheck[i])) {
      result.push(arrCheck[i]);
    }
  }
  return result;
}

let newArr = checkSimple([
  11, 2, 3, 4, 5, 6, 7, 8, 9, 8, 8, 8, 7, 7, 5, 13, 103,
]);
console.log("result", newArr);

// Вам необхідно написати функцію, яка приймає на вхід масив об'єктів, де кожен об'єкт описує сповіщення та має поля source / text / date.
// Вам необхідно перетворити цей масив на об'єкт, де ключем буде джерело сповіщення, а значенням - масив сповіщень із цього джерела.
